#include <iostream>
//#include <iostream>是头文件，用于引入外部库，是一个可以用来输入输出的“工具”，之后还会有更多头文件，甚至可以自行编写头文件，也就是造一个工具
using namespace std;//每句话后都要跟上分号，注意是英文分号而不是中文分号，编写程序时是绝对不准出现中文符号的！！！
//using namespace std;是命名空间声明语句，作用是告诉编译器："如果找不到某个名字，就去 std 命名空间里找"
//什么是命名空间？命名空间 = 名字的"文件夹"
int main() {
//int main()是主函数，计算机运行程序的时候，会从后面的大括号开始运行，依次执行大括号中的语句直到结束
	cout << "Hello,World!" << endl;
    //cout << "Hello,World!" << endl是输出语句，其中endl的作用是换行
	//注意，endl中的'l'是小写的L，不是数字1
	//注意cout后面接的是两个小括号，别搞混了
	//
	//cout << 后面的"双引号"内可以向屏幕输出英文，标点符号以及空格等等
	//但是不可以直接输出中文，目前阶段还不需要输出中文（不过你想研究可以上网上研究）
	return (0);
    //return 0；的意思是主函数需要返回一个0，说明程序正常结束，如果return一个非0值，会被认为运行错误
	//return 0和return(0)含义相同
}