#include <iostream>
using namespace std;

int main() {
	int x;
	cin >> x;

	bool O = (x % 2 == 0);//注意：判定时要用两个=，赋值时只需一个=
	bool P = (x > 4 && x <= 12);
//bool 是 C++ 中的布尔类型，专门用来表示真/假两种状态。
//布尔变量就像两个开关，O 记录"是否偶数"，P 记录"是否在范围内"。把判断结果存起来，后面就可以反复使用，不用重复写条件
//注意：C++ 中 bool 类型在 cout 输出时，true 自动转为 1，false 自动转为 0，所以下面可以直接输出
	cout << (O && P) << " ";
	cout << (O || P) << " ";
// || 是逻辑或运算符，表示 "或者"
	cout << ((O || P) && !(O && P)) << " ";
// ! 是逻辑非运算符，表示 "取反"、"不是"
//此处的！符号并不是和&&联动使用的，!在这句话的作用是取(O && P)的补集
	cout << (!O && !P);
	return 0;
}