#include<iostream>
using namespace std;

int main() {
	char s[6];//开一个能存6个字符的数组
	cin.getline(s, 6);//最多读5个字符（留1个位置给'\0'）
	//cin.getline(字符数组名，长度) 是 C++ 中读取一行字符串（包含空格）的函数
	//源于iostream,属于 cin 对象的一个方法
	//双引号定义的字符串 和 标准输入函数，尾部会自带一个 '\0'；只有你自己用花括号一个字符一个字符赋值时，才需要手动添加
	int ans = 0;
	for (int i = 0;s[i] != '\0';i++) {
		//'\0'是字符串结束标志，遇到就停止遍历，其ASCII码为0
		if (s[i] != ' ' && s[i] != '\n') {
			//'\n'是C+中的换行符，是一个转义字符，ASCII码值为10
			ans++;
		}
	}
	//ASCII 码（读作 "阿斯克码"）是 美国信息交换标准代码 的缩写，简单说就是 「给每个字符编一个数字号」
	//ASCII 码能让计算机能存住字母、数字、符号，是 "字符和数字的翻译对照表"
	//你只需要记住 '0'=48、'A'=65、'a'=97 三个起点，其他全可以推算
	cout << ans << endl;
	return 0;
}