#include<iostream>
using namespace std;

int main() {
	int n, m;
	cin >> n >> m;

	int a[102][102];
	int b[102][102];
	//可以令二维数组a[][]存入旋转之前的图像，对其底标更改顺序后存入b[][]来输出旋转之后的图像
	for (int i = 0;i < n;i++) {
		for (int j = 0;j < m;j++) {
			cin >> a[i][j];//不断地读入原图像的上的数据,存入其对应的底标中
			//我们用左中括号中当前i的值来表示横坐标，右括号中当前j的值来表示纵坐标
		}
	}
	for (int i = 0;i < n; i++) {
		for (int j = 0;j < m;j++) {
			b[j][n - 1 - i] = a[i][j];
			//顺时针旋转90°,在草稿纸上画一遍我们能发现，其纵坐标等于之前的横坐标，横坐标是倒过来读的纵坐标
			//所以令B数组的横坐标为j,纵坐标为n-1-i
			//为什么是n-1-i？因为a[i][j]中i的最大值就是n-1,倒过来数自然是n-1减去原来的i值
			//(如果一个数组有n个容量，那么这个数组的底标的范围就是0,到n-1)
		}
	}
	for (int i = 0;i < m;i++) {
		for (int j = 0;j < n;j++) {
			cout << b[i][j] << " ";
		}//将b[][]中的图像输出
		cout << endl;
	}
	return 0;
}