#include<iostream>
using namespace std;

bool Prime(int n) {
	// 质数定义：大于 1 且只能被 1 和自身整除
	// 先制作一个判断某个数是否为质数的布尔函数
	if (n < 2) return false;
	// 当n<2时，视其为非质数
	for (int i = 2;i * i <= n;i++) {
		// 从 2 试除到 √n 即可,因为如果 n 有大于 √n 的因子，必然对应一个小于 √n 的因子
		// 当然你也可以全部试除，只不过是这样要消耗更多时间和内存
		if (n % i == 0) return false;
		//如果能整除，说明 n 有除了 1 和自身以外的因子 → 不是质数
	}
	return true;
	// 所有可能的因子都试过了，都没有整除 → 是质数
}
// 强烈建议同学们在草稿本上推算一下，3分钟就能搞懂

int main() {
	int N;
	cin >> N;
	//读取一个正偶数 N
	for (int i = 4; i <= N; i += 2) {
		//最小的哥德巴赫数是4，我们从4开始依次将每个偶数赋值为i（注意for循环变量更新这一步是i+=2)
		for (int j = 2;j <= i / 2;j++) {
			//接着我们从2开始依次将每个数赋值为j进行判定
			//循环最多到i/2即可，因为如果有j > i / 2的因子，就必然有一个j < i / 2的因子
			if (Prime(j) && Prime(i - j)) {
				//判定:读到的数为质数，且当前i值减去该数j后得到的也是质数
				cout << i << "=" << j << "+" << i - j << endl;
				//依照体重所给的格式输出i=j+(i-j)
				break;//然后打破当前内部for循环，题目里面要求了输出i最小的组合，且不输出全部组合
				//break只能打破一个最内存循环，所以外部循环依旧在执行
			}
		}
	}
	return 0;
}